const engineParts = [
    {
      name: "block",
      label: "Цилиндр двигателя",
      info: "Одна из цилиндрических камер двигателя внутреннего сгорания. Это пространство, в котором перемещается поршень, приводимый в движение энергией, вырабатываемой при сгорании топливовоздушной смеси в камере сгорания."
    },
    {
      name: "kolen",
      label: "Коленчатый вал",
      info: "Преобразует возвратно-поступательное движение поршня в вращательное."
    },
    {
      name: "porsh",
      label: "Поршень",
      info: "Деталь, движущаяся в цилиндре под давлением газов."
    },
    {
      name: "rasp",
      label: "Распределительный вал",
      info: "Вал двигателя внутреннего сгорания, управляющий открытием и закрытием клапанов двигателя. Основная деталь газораспределительного механизма (ГРМ), служащего для синхронизации тактов работы двигателя и впуска-выпуска топливной смеси/воздуха и отработанных газов."
    },
    {
      name: "gener",
      label: "Генератор",
      info: "Устройство, которое преобразует механическую энергию, получаемую от двигателя, в электрическую. Он необходим для питания бортовой сети машины, от которой работают электроприборы, и для зарядки аккумулятора."
    },
    {
        name: "svech",
        label: "Свеча зажигания",
        info: "Устройство, которое устанавливается в цилиндрах двигателя внутреннего сгорания и служит для воспламенения смеси топлива и воздуха."
      },
      {
        name: "podd",
        label: "Поддон",
        info: "Корпусная деталь двигателя внутреннего сгорания (ДВС), предназначенная для хранения и сбора масла."
      }
  ];
  